Revit 2024 API
BuiltInFailures.ArrayFailures.IdenticalGeometryCopiesInArray Property
 This array contains multiple copies of some identical geometry. Performance might be improved by using a nested family and arraying copies of its instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId IdenticalGeometryCopiesInArray { get; }
Visual Basic
Public Shared ReadOnly Property IdenticalGeometryCopiesInArray As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ IdenticalGeometryCopiesInArray {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ArrayFailures Class
Autodesk.Revit.DB Namespace